sourcecode.org
# -*- org-src-preserve-indentation: t -*-
#+Title:
#+Date:
#+Author:


* introduction

* Basic idea

A dungeon crawler set in a modern day office space (with cubicles, cantinas etc.) instead of fighting I need another way of handling engagement.

* Actor                                                               :Actor: 

An actor is anything that is supposed to have sentience and behaviour ingame.

** "Races"                                                            :Races:

- Zzzombie
  - the constantly sleepy coworker, never seems to be quite awake nor have they had a good nights sleep in their life.
- Gobbo
  - The coworker who handles mails, you're not sure if they've ever had a shower, but the greasy strands of hair makes you think not.
- Creeps
  - The coworker who is most stealthy. But of course also the most disliked by everyone.
- Emotional vampire
- Ghost
- Troglodytes
  - A primitive being, from a simpler time. Much, much simpler time.


** Classes                                                            :Class:

- Financial

- IT Wizard
  - Can log into any computer and electronic system (HINT: it's cause everyones password is "Password1")
- Assistant
- Intern
- Secretary
- Janitor
- Manager
- HR
  - is practically a wizard in their own right, they've spent years on HR seminars learning the archaic guidelines and are able to recite them. However no one else knows entirely IF they are made up or not.
- Boss

** Stats                                                              :Stats:

Stats in an RPG is like... something... really... hmm (ed: come back with a zinger here). Usually the stats in a traditional roguelike might be something akin to - Constitution, Strength, Wisdom, Intelligence etc. basically if you've seen a rulebook for a TTRPG you can probably recognize most of these AND THEY WORK! that's why people use them, they really REALLY work. I'm not choosing differently because I think I can do better, but because, well since the game is already set in a modern office environment, there's little reason to not have some weird quirk with the stats again.

*** List of stats to consider:
- Neuroticism: how panicked and alert a player is about their surrounding.
- Openness: how open they can allow themself to be.
- Reasoning: how good they are at logically deducting things, (maybe reasoning and neuroticism can kindda benefit and be a detriment at the same time)
- Madness: How mad the character is (remember! you don't have to be mad to work here, but it helps!) 
- Agreeableness: How much other characters like you.
- Laziness: How much (or little :/ ) energy a character has.


I Really REALLY wanted to put "Agility" into this stat list, but not agility as it is traditionally used, but more as in the agile method that is usually claimed by every company under the sun that has too much money and not enough sensible managers/CEOs. Though I feel like that'll be an unnescessary dig at alot of people I have tremendous respect for. (though maybe they don't care what a nobody on the internet does or say... I dunno :) )

So that's the N.O.R.M.A.L. stat system (you'd think I'd have picked these words carefully... and you'd be right) patent pending yadda yadda.

