sourcecode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-28 Thu 13:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1ead58c">1. introduction</a></li>
<li><a href="#orga8b91b4">2. Basic idea</a></li>
<li><a href="#orgdb5a2dc">3. Actor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></a>
<ul>
<li><a href="#orgb211649">3.1. "Races"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Races">Races</span></span></a></li>
<li><a href="#org180025c">3.2. Classes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Class">Class</span></span></a></li>
<li><a href="#org544d3cd">3.3. Stats&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Stats">Stats</span></span></a>
<ul>
<li><a href="#org89d9968">3.3.1. List of stats to consider:</a></li>
<li><a href="#org92d2945">3.3.2. In game stats</a></li>
</ul>
</li>
<li><a href="#org74e9961">3.4. Spells</a></li>
<li><a href="#org2945e8c">3.5. HR Guidelines</a></li>
</ul>
</li>
<li><a href="#org034b909">4. Code</a></li>
<li><a href="#org2f6b68a">5. Globals</a></li>
<li><a href="#org17a5482">6. Positional handling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Position">Position</span></span></a>
<ul>
<li><a href="#orga152b18">6.1. Cell function&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Coordinate">Coordinate</span></span></a></li>
<li><a href="#org309dfd4">6.2. Collision&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Collision">Collision</span></span></a></li>
<li><a href="#orgfff8d3c">6.3. Move&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Update">Update</span></span></a></li>
<li><a href="#org3df2669">6.4. Vector&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Datacontainer">Datacontainer</span>&#xa0;<span class=""></span>&#xa0;<span class="Coordinate">Coordinate</span></span></a></li>
</ul>
</li>
<li><a href="#orgec80ced">7. Input&#xa0;&#xa0;&#xa0;<span class="tag"><span class="IO">IO</span></span></a>
<ul>
<li><a href="#org1c778cf">7.1. Input player movement</a></li>
<li><a href="#org9dc2227">7.2. Ressource handler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="File">File</span></span></a>
<ul>
<li><a href="#orge6e0418">7.2.1. File class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></a></li>
<li><a href="#org3082ed3">7.2.2. Tilesheet class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1ca6959">8. Time</a>
<ul>
<li><a href="#orga36d030">8.1. Turn&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></a></li>
</ul>
</li>
<li><a href="#org0ff5b6f">9. Window handler</a></li>
<li><a href="#org78a5920">10. View MIGHT BE REMOVED</a></li>
<li><a href="#orgbbef585">11. Drawing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Onscreen">Onscreen</span></span></a>
<ul>
<li><a href="#org3810c81">11.1. Drawmap&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Map">Map</span></span></a></li>
<li><a href="#org74b4b28">11.2. Drawing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Characters">Characters</span></span></a></li>
</ul>
</li>
<li><a href="#org08ac217">12. Map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Map">Map</span></span></a></li>
<li><a href="#org8cf3768">13. Actor list&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></a></li>
<li><a href="#orgaa8e914">14. Game Loop function</a></li>
<li><a href="#org31a3f13">15. <span class="todo TODO">TODO</span> Text&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Text">Text</span></span></a>
<ul>
<li><a href="#orga289329">15.1. <span class="todo TODO">TODO</span> Textprinting&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Onscreen">Onscreen</span></span></a></li>
<li><a href="#org7810ed5">15.2. <span class="todo TODO">TODO</span> Textformatting</a></li>
<li><a href="#orgee4354d">15.3. <span class="todo TODO">TODO</span> Textinput</a></li>
</ul>
</li>
<li><a href="#org9c35727">16. Actor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></a>
<ul>
<li><a href="#org292f3ce">16.1. Actor class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Datacontainer">Datacontainer</span></span></a></li>
<li><a href="#orgfe62f71">16.2. Update Actors</a></li>
</ul>
</li>
<li><a href="#org2a4c3f7">17. Main</a></li>
</ul>
</div>
</div>


<div id="outline-container-org1ead58c" class="outline-2">
<h2 id="org1ead58c"><span class="section-number-2">1.</span> introduction</h2>
</div>

<div id="outline-container-orga8b91b4" class="outline-2">
<h2 id="orga8b91b4"><span class="section-number-2">2.</span> Basic idea</h2>
<div class="outline-text-2" id="text-2">
<p>
A dungeon crawler set in a modern day office space (with cubicles, cantinas etc.) instead of fighting I need another way of handling engagement.
</p>
</div>
</div>

<div id="outline-container-orgdb5a2dc" class="outline-2">
<h2 id="orgdb5a2dc"><span class="section-number-2">3.</span> Actor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></h2>
<div class="outline-text-2" id="text-3">
<p>
An actor is anything that is supposed to have sentience and behaviour ingame.
</p>
</div>

<div id="outline-container-orgb211649" class="outline-3">
<h3 id="orgb211649"><span class="section-number-3">3.1.</span> "Races"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Races">Races</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Zzzombie - the constantly sleepy coworker, never seems to be quite awake nor have they had a good nights sleep in their life.</li>
<li>Gobbo - The coworker who handles mails, you're not sure if they've ever had a shower, but the greasy strands of hair makes you think not.</li>
<li>Creeps -</li>
<li>Emotional vampire</li>
<li>Ghost</li>
<li>Troglodytes</li>
</ul>
</div>
</div>


<div id="outline-container-org180025c" class="outline-3">
<h3 id="org180025c"><span class="section-number-3">3.2.</span> Classes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Class">Class</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Financial</li>
<li>IT Wizard</li>
<li>Assistant</li>
<li>Intern</li>
<li>Secretary</li>
<li>Janitor</li>
<li>Manager</li>
<li>HR</li>
<li>Boss</li>
</ul>
</div>
</div>

<div id="outline-container-org544d3cd" class="outline-3">
<h3 id="org544d3cd"><span class="section-number-3">3.3.</span> Stats&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Stats">Stats</span></span></h3>
<div class="outline-text-3" id="text-3-3">
<p>
Stats in an RPG is like&#x2026; something&#x2026; really&#x2026; hmm (ed: come back with a zinger here). Usually the stats in a traditional roguelike might be something akin to - Constitution, Strength, Wisdom, Intelligence etc. basically if you've seen a rulebook for a TTRPG you can probably recognize most of these AND THEY WORK! that's why people use them, they really REALLY work. I'm not choosing differently because I think I can do better, but because, well since the game is already set in a modern office environment, there's little reason to not have some weird quirk with the stats again.
</p>
</div>

<div id="outline-container-org89d9968" class="outline-4">
<h4 id="org89d9968"><span class="section-number-4">3.3.1.</span> List of stats to consider:</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Neuroticism: how panicked and alert a player is about their surrounding.</li>
<li>Openness: how open they can allow themself to be.</li>
<li>Reasoning: how good they are at logically deducting things, (maybe reasoning and neuroticism can kindda benefit and be a detriment at the same time)</li>
<li>Madness: How mad the character is (remember! you don't have to be mad to work here, but it helps!)</li>
<li>Agreeableness: How much other characters like you.</li>
<li>Laziness: How much (or little :/ ) energy a character has.</li>
</ul>


<p>
I Really REALLY wanted to put "Agility" into this stat list, but not agility as it is traditionally used, but more as in the agile method that is usually claimed by every company under the sun that has too much money and not enough sensible managers/CEOs. Though I feel like that'll be an unnescessary dig at alot of people I have tremendous respect for. (though maybe they don't care what a nobody on the internet does or say&#x2026; I dunno :) )
</p>

<p>
So that's the N.O.R.M.A.L. stat system (you'd think I'd have picked these words carefully&#x2026; and you'd be right) patent pending yadda yadda.
</p>
</div>
</div>
