sourcecode.tex
% Created 2022-07-28 Thu 13:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.5.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents



\section{introduction}
\label{sec:org30fbc15}

\section{Basic idea}
\label{sec:orge5f1cb4}

A dungeon crawler set in a modern day office space (with cubicles, cantinas etc.) instead of fighting I need another way of handling engagement.

\section{Actor\hfill{}\textsc{Actor}}
\label{sec:org0c34810}

An actor is anything that is supposed to have sentience and behaviour ingame.

\subsection{"Races"\hfill{}\textsc{Races}}
\label{sec:org79d5564}

\begin{itemize}
\item Zzzombie - the constantly sleepy coworker, never seems to be quite awake nor have they had a good nights sleep in their life.
\item Gobbo - The coworker who handles mails, you're not sure if they've ever had a shower, but the greasy strands of hair makes you think not.
\item Creeps -
\item Emotional vampire
\item Ghost
\item Troglodytes
\end{itemize}


\subsection{Classes\hfill{}\textsc{Class}}
\label{sec:orga7c3347}

\begin{itemize}
\item Financial
\item IT Wizard
\item Assistant
\item Intern
\item Secretary
\item Janitor
\item Manager
\item HR
\item Boss
\end{itemize}

\subsection{Stats\hfill{}\textsc{Stats}}
\label{sec:org1df1ee9}

Stats in an RPG is like\ldots{} something\ldots{} really\ldots{} hmm (ed: come back with a zinger here). Usually the stats in a traditional roguelike might be something akin to - Constitution, Strength, Wisdom, Intelligence etc. basically if you've seen a rulebook for a TTRPG you can probably recognize most of these AND THEY WORK! that's why people use them, they really REALLY work. I'm not choosing differently because I think I can do better, but because, well since the game is already set in a modern office environment, there's little reason to not have some weird quirk with the stats again.

\subsubsection{List of stats to consider:}
\label{sec:orgf5d491d}
\begin{itemize}
\item Neuroticism: how panicked and alert a player is about their surrounding.
\item Openness: how open they can allow themself to be.
\item Reasoning: how good they are at logically deducting things, (maybe reasoning and neuroticism can kindda benefit and be a detriment at the same time)
\item Madness: How mad the character is (remember! you don't have to be mad to work here, but it helps!)
\item Agreeableness: How much other characters like you.
\item Laziness: How much (or little :/ ) energy a character has.
\end{itemize}


I Really REALLY wanted to put "Agility" into this stat list, but not agility as it is traditionally used, but more as in the agile method that is usually claimed by every company under the sun that has too much money and not enough sensible managers/CEOs. Though I feel like that'll be an unnescessary dig at alot of people I have tremendous respect for. (though maybe they don't care what a nobody on the internet does or say\ldots{} I dunno :) )

So that's the N.O.R.M.A.L. stat system (you'd think I'd have picked these words carefully\ldots{} and you'd be right) patent pending yadda yadda.
