sourcecode.org
*** In game stats

Health
- Phys-Health
  - is made out of Laziness (the lower the laziness the higher the health), Openness
- Mental-Health
  - is made out of Madness, Reasoning.
- Social-Health
  - Agreeableness, Neuroticism

- HR-cana
  - Is defined by Madness, Agreeableness


** Spells

A magic system wouldn't really work in a contemporary world. There is however something more arcane and mysterious that I can employ which is: HR guidelines.

** HR Guidelines

The HR guidelines should, like all magic systems. Affect stats in some way.

* Code

How neat would it be if we could quit here? alas now we have to try and code this :S 
Ah well into the fray.



#+Name: import
#+begin_src python :tangle "sourcecode.py"
from __future__ import annotations
from abc import ABC, abstractmethod
import pygame
import pprint
from pygame.locals import *
import numpy
from collections.abc import Callable
from functools import reduce, cache, wraps, partial
import json
from dataclasses import dataclass, field
from datetime import datetime
from rx.scheduler.mainloop import PyGameScheduler
#+end_src

* Globals

Global variables are frowned upon by virtually everyone and their mom, which is fair, I don't like them either, but I don't have a better idea.

Global variables are the following
- cell size, i.e. how large the cell that fills the screen surface should be. Then I can later just divide the screenwidth or screenheight of the drawing destination surface by the cell size to know how big the are is. (so I don't draw outside the screen/surface), this is also where I'm placing the filenames for fonts which I might need/want to change. 

#+Name: GLOBALS
#+begin_src python :noweb yes :tangle "sourcecode.py"
CELLSIZE = 32
FONTFILE = "terminal8x8_gs_ro.png"
#+end_src


* Positional handling                                              :Position:

Positional functions all tackles different aspect of onscreen positioning. Things lige moving, checking collisions. multiplying a vector tuple so that it uses the correct 

** Cell function                                                 :Coordinate:

The cell function handles converting the direction vectors into coordinates that can be used on the screen

#+Name: Cell
#+begin_src python :nowrap yes :tangle "sourcecode.py"
def Cell(cell : (int, int)) -> (int, int):
    return tuple(map(lambda n : n * CELLSIZE, cell))
#+end_src


** Collision                                                      :Collision:

The collision function gets two position tuples and checks if they are the same, if they are it returns true if not it returns false

#+Name: Collision
#+begin_src python :noweb yes :tangle "sourcecode.py"
def collision(xy, _xy):
    return xy == _xy
#+end_src


** Move                                                              :Update:

Move function is just meant to take tqwo positional arguments, the current position and the destination, and return a new tuple with the new current position. I believe It *could* theoretically maybe, potentially handle diagonal movement - ish but this is just you grandmas 4 directional moves.

#+Name: Move
#+begin_src python :nowrap yes :tangle "sourcecode.py"
def move(xy : (int,int), _xy : (int, int)) -> (int, int):
    acc = []
    for n, _n in zip(xy, _xy):
        if n > _n:
            n = n - 2
        elif n < _n:
            n = n + 2
        acc.append(n)
    return tuple(acc)

#+end_src


