sourcecode.html

<div id="outline-container-org92d2945" class="outline-4">
<h4 id="org92d2945"><span class="section-number-4">3.3.2.</span> In game stats</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Health
</p>
<ul class="org-ul">
<li>Phys-Health
<ul class="org-ul">
<li>is made out of Laziness (the lower the laziness the higher the health), Openness</li>
</ul></li>
<li>Mental-Health
<ul class="org-ul">
<li>is made out of Madness, Reasoning.</li>
</ul></li>
<li>Social-Health
<ul class="org-ul">
<li>Agreeableness, Neuroticism</li>
</ul></li>

<li>HR-cana
<ul class="org-ul">
<li>Is defined by Madness, Agreeableness</li>
</ul></li>
<li></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org74e9961" class="outline-3">
<h3 id="org74e9961"><span class="section-number-3">3.4.</span> Spells</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A magic system wouldn't really work in a contemporary world. There is however something more arcane and mysterious that I can employ which is: HR guidelines.
</p>
</div>
</div>

<div id="outline-container-org2945e8c" class="outline-3">
<h3 id="org2945e8c"><span class="section-number-3">3.5.</span> HR Guidelines</h3>
<div class="outline-text-3" id="text-3-5">
<p>
The HR guidelines should, like all magic systems. Affect stats in some way.
</p>
</div>
</div>
</div>

<div id="outline-container-org034b909" class="outline-2">
<h2 id="org034b909"><span class="section-number-2">4.</span> Code</h2>
<div class="outline-text-2" id="text-4">
<p>
How neat would it be if we could quit here? alas now we have to try and code this :S 
Ah well into the fray.
</p>



<div class="org-src-container">
<pre class="src src-python" id="org3736006"><span style="color: #00ffff;">from</span> __future__ <span style="color: #00ffff;">import</span> annotations
<span style="color: #00ffff;">from</span> abc <span style="color: #00ffff;">import</span> ABC, abstractmethod
<span style="color: #00ffff;">import</span> pygame
<span style="color: #00ffff;">import</span> pprint
<span style="color: #00ffff;">from</span> pygame.<span style="color: #b0c4de;">locals</span> <span style="color: #00ffff;">import</span> *
<span style="color: #00ffff;">import</span> numpy
<span style="color: #00ffff;">from</span> collections.abc <span style="color: #00ffff;">import</span> Callable
<span style="color: #00ffff;">from</span> functools <span style="color: #00ffff;">import</span> <span style="color: #b0c4de;">reduce</span>, cache, wraps, partial
<span style="color: #00ffff;">import</span> json
<span style="color: #00ffff;">from</span> dataclasses <span style="color: #00ffff;">import</span> dataclass, field
<span style="color: #00ffff;">import</span> operator
<span style="color: #00ffff;">import</span> rx
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f6b68a" class="outline-2">
<h2 id="org2f6b68a"><span class="section-number-2">5.</span> Globals</h2>
<div class="outline-text-2" id="text-5">
<p>
Global variables are frowned upon by virtually everyone and their mom, which is fair, I don't like them either, but I don't have a better idea.
</p>

<p>
Global variables are the following
</p>
<ul class="org-ul">
<li>cell size, i.e. how large the cell that fills the screen surface should be. Then I can later just divide the screenwidth or screenheight of the drawing destination surface by the cell size to know how big the are is. (so I don't draw outside the screen/surface), this is also where I'm placing the filenames for fonts which I might need/want to change.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python" id="org2e15c4b"><span style="color: #7fffd4;">CELLSIZE</span> = 32
<span style="color: #7fffd4;">FONTFILE</span> = <span style="color: #ffc1c1;">"terminal8x8_gs_ro.png"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org17a5482" class="outline-2">
<h2 id="org17a5482"><span class="section-number-2">6.</span> Positional handling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Position">Position</span></span></h2>
<div class="outline-text-2" id="text-6">
<p>
Positional functions all tackles different aspect of onscreen positioning. Things lige moving, checking collisions. multiplying a vector tuple so that it uses the correct 
</p>
</div>

<div id="outline-container-orga152b18" class="outline-3">
<h3 id="orga152b18"><span class="section-number-3">6.1.</span> Cell function&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Coordinate">Coordinate</span></span></h3>
<div class="outline-text-3" id="text-6-1">
<p>
The cell function handles converting the direction vectors into coordinates that can be used on the screen
</p>

<div class="org-src-container">
<pre class="src src-python" id="org1c1ffdf"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">Cell</span>(cell : (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>)) -&gt; (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #b0c4de;">tuple</span>(<span style="color: #b0c4de;">map</span>(<span style="color: #00ffff;">lambda</span> n : n * CELLSIZE, cell))
</pre>
</div>
</div>
</div>


<div id="outline-container-org309dfd4" class="outline-3">
<h3 id="org309dfd4"><span class="section-number-3">6.2.</span> Collision&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Collision">Collision</span></span></h3>
<div class="outline-text-3" id="text-6-2">
<p>
The collision function gets two position tuples and checks if they are the same, if they are it returns true if not it returns false
</p>

<div class="org-src-container">
<pre class="src src-python" id="org3725709"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">collision</span>(xy, _xy):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> xy == _xy
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfff8d3c" class="outline-3">
<h3 id="orgfff8d3c"><span class="section-number-3">6.3.</span> Move&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Update">Update</span></span></h3>
<div class="outline-text-3" id="text-6-3">
<p>
Move function is just meant to take tqwo positional arguments, the current position and the destination, and return a new tuple with the new current position. I believe It <b>could</b> theoretically maybe, potentially handle diagonal movement - ish but this is just you grandmas 4 directional moves.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org14e1f4c"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">move</span>(xy : (<span style="color: #b0c4de;">int</span>,<span style="color: #b0c4de;">int</span>), _xy : (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>)) -&gt; (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">acc</span> = []
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> n, _n <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">zip</span>(xy, _xy):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">if</span> n &gt; _n:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">n</span> = n - 2
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">elif</span> n &lt; _n:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">n</span> = n + 2
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   acc.append(n)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #b0c4de;">tuple</span>(acc)

</pre>
</div>
</div>
</div>
