sourcecode.tex

\subsubsection{In game stats}
\label{sec:org3f9fd3b}

Health
\begin{itemize}
\item Phys-Health
\begin{itemize}
\item is made out of Laziness (the lower the laziness the higher the health), Openness
\end{itemize}
\item Mental-Health
\begin{itemize}
\item is made out of Madness, Reasoning.
\end{itemize}
\item Social-Health
\begin{itemize}
\item Agreeableness, Neuroticism
\end{itemize}

\item HR-cana
\begin{itemize}
\item Is defined by Madness, Agreeableness
\end{itemize}
\item 
\end{itemize}


\subsection{Spells}
\label{sec:orgaf3bed3}

A magic system wouldn't really work in a contemporary world. There is however something more arcane and mysterious that I can employ which is: HR guidelines.

\subsection{HR Guidelines}
\label{sec:orgd80c8e5}

The HR guidelines should, like all magic systems. Affect stats in some way.

\section{Code}
\label{sec:org674b2d0}

How neat would it be if we could quit here? alas now we have to try and code this :S 
Ah well into the fray.



\begin{verbatim}
from __future__ import annotations
from abc import ABC, abstractmethod
import pygame
import pprint
from pygame.locals import *
import numpy
from collections.abc import Callable
from functools import reduce, cache, wraps, partial
import json
from dataclasses import dataclass, field
import operator
import rx
\end{verbatim}

\section{Globals}
\label{sec:org345a086}

Global variables are frowned upon by virtually everyone and their mom, which is fair, I don't like them either, but I don't have a better idea.

Global variables are the following
\begin{itemize}
\item cell size, i.e. how large the cell that fills the screen surface should be. Then I can later just divide the screenwidth or screenheight of the drawing destination surface by the cell size to know how big the are is. (so I don't draw outside the screen/surface), this is also where I'm placing the filenames for fonts which I might need/want to change.
\end{itemize}

\begin{verbatim}
CELLSIZE = 32
FONTFILE = "terminal8x8_gs_ro.png"
\end{verbatim}


\section{Positional handling\hfill{}\textsc{Position}}
\label{sec:org3ff2447}

Positional functions all tackles different aspect of onscreen positioning. Things lige moving, checking collisions. multiplying a vector tuple so that it uses the correct 

\subsection{Cell function\hfill{}\textsc{Coordinate}}
\label{sec:orge37d44c}

The cell function handles converting the direction vectors into coordinates that can be used on the screen

\begin{verbatim}
def Cell(cell : (int, int)) -> (int, int):
    return tuple(map(lambda n : n * CELLSIZE, cell))
\end{verbatim}


\subsection{Collision\hfill{}\textsc{Collision}}
\label{sec:orga35f0f7}

The collision function gets two position tuples and checks if they are the same, if they are it returns true if not it returns false

\begin{verbatim}
def collision(xy, _xy):
    return xy == _xy
\end{verbatim}


\subsection{Move\hfill{}\textsc{Update}}
\label{sec:orge98f3f6}

Move function is just meant to take tqwo positional arguments, the current position and the destination, and return a new tuple with the new current position. I believe It \textbf{could} theoretically maybe, potentially handle diagonal movement - ish but this is just you grandmas 4 directional moves.

\begin{verbatim}
def move(xy : (int,int), _xy : (int, int)) -> (int, int):
    acc = []
    for n, _n in zip(xy, _xy):
        if n > _n:
            n = n - 2
        elif n < _n:
            n = n + 2
        acc.append(n)
    return tuple(acc)

\end{verbatim}
