sourcecode.org
** Vector                                         :Datacontainer::Coordinate:

The vector class is basically a copy of a tuple datatype, however it has the added "__add__" and "__sub__" methods defined. I don't really need (at the moment) to handle more "advanced" features like vector dot product and so on.

#+Name: Vector
#+begin_src python :nowrap yes :tangle "sourcecode.py"
@dataclass(frozen=True)
class Vector:
    x : int
    y : int
    def __add__(self, other):
        return Vector(self.x + other.x, self.y + other.y)
    def __sub__(self, other):
        return Vector(self.x - other.x, self.y - other.y)
#+end_src


* Input                                                                  :IO:

** Input player movement                                                  

for now I just handle the input through a simple function that checks whether or not a valid key has been pressed. if not it returns a (0,0) vector. 

#+Name: Input
#+begin_src python :noweb yes :tangle "sourcecode.py"
def getInput(ev):
    inputList = { pygame.K_UP : (0,-1),
                  pygame.K_DOWN : (0,1),
                  pygame.K_LEFT : (-1, 0),
                  pygame.K_RIGHT : (1, 0),
    }
    return inputList.get(ev.key, (0,0))
#+end_src





** Ressource handler                                                   :File:

Another euqually import (or more important input) is the different ressources. For now it is only a config json file and a tilesheet, I'm interested in, but it could expand to more tilesheets, or even premade levels (or templates). The ressources are being loaded into a file class that holds the different information.

#+Name: File load
#+begin_src python :nowrap yes :tangle "sourcecode.py"
def loadFiles() -> ConfigFile:
    _fontImage = pygame.image.load("terminal8x8_gs_ro.png")
    _fontImage.set_colorkey((0,0,0))
    with open('conf.json', 'r') as _file:
        config = json.load(_file)
    return ConfigFile(_fontImage, config)
#+end_src

*** File class                                                :datacontainer:

The file class is an immutable data container that holds the information needed for the game to function

#+Name: File
#+begin_src python :nowrap yes :tangle "sourcecode.py"
@dataclass(frozen=True)
class ConfigFile:
    _image : pygame.Surface
    _conf : dict
    def image(self) -> pygame.Surface:
        return self._image
    def config(self) -> dict:
        return self._conf
#+end_src



