sourcecode.html


<div id="outline-container-org3df2669" class="outline-3">
<h3 id="org3df2669"><span class="section-number-3">6.4.</span> Vector&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Datacontainer">Datacontainer</span>&#xa0;<span class=""></span>&#xa0;<span class="Coordinate">Coordinate</span></span></h3>
<div class="outline-text-3" id="text-6-4">
<p>
The vector class is basically a copy of a tuple datatype, however it has the added "<span class="underline"><span class="underline">add</span></span>" and "<span class="underline"><span class="underline">sub</span></span>" methods defined. I don't really need (at the moment) to handle more "advanced" features like vector dot product and so on.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orga1e22ff"><span style="color: #63b8ff;">@dataclass</span>(frozen=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">Vector</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   x : <span style="color: #b0c4de;">int</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   y : <span style="color: #b0c4de;">int</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__add__</span>(<span style="color: #00ffff;">self</span>, other):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> Vector(<span style="color: #00ffff;">self</span>.x + other.x, <span style="color: #00ffff;">self</span>.y + other.y)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__sub__</span>(<span style="color: #00ffff;">self</span>, other):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> Vector(<span style="color: #00ffff;">self</span>.x - other.x, <span style="color: #00ffff;">self</span>.y - other.y)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgec80ced" class="outline-2">
<h2 id="orgec80ced"><span class="section-number-2">7.</span> Input&#xa0;&#xa0;&#xa0;<span class="tag"><span class="IO">IO</span></span></h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1c778cf" class="outline-3">
<h3 id="org1c778cf"><span class="section-number-3">7.1.</span> Input player movement</h3>
<div class="outline-text-3" id="text-7-1">
<p>
for now I just handle the input through a simple function that checks whether or not a valid key has been pressed. if not it returns a (0,0) vector. 
</p>

<div class="org-src-container">
<pre class="src src-python" id="org5c92400"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">getInput</span>(ev):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">inputList</span> = { pygame.K_UP : (0,-1),
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span> pygame.K_DOWN : (0,1),
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span> pygame.K_LEFT : (-1, 0),
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span> pygame.K_RIGHT : (1, 0),
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   }
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> inputList.get(ev.key, (0,0))
</pre>
</div>
</div>
</div>





<div id="outline-container-org9dc2227" class="outline-3">
<h3 id="org9dc2227"><span class="section-number-3">7.2.</span> Ressource handler&#xa0;&#xa0;&#xa0;<span class="tag"><span class="File">File</span></span></h3>
<div class="outline-text-3" id="text-7-2">
<p>
Another euqually import (or more important input) is the different ressources. For now it is only a config json file and a tilesheet, I'm interested in, but it could expand to more tilesheets, or even premade levels (or templates). The ressources are being loaded into a file class that holds the different information.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org788f202"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">loadFiles</span>() -&gt; ConfigFile:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_fontImage</span> = pygame.image.load(<span style="color: #ffc1c1;">"terminal8x8_gs_ro.png"</span>)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _fontImage.set_colorkey((0,0,0))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">with</span> <span style="color: #b0c4de;">open</span>(<span style="color: #ffc1c1;">'conf.json'</span>, <span style="color: #ffc1c1;">'r'</span>) <span style="color: #00ffff;">as</span> _file:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">config</span> = json.load(_file)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> ConfigFile(_fontImage, config)
</pre>
</div>
</div>

<div id="outline-container-orge6e0418" class="outline-4">
<h4 id="orge6e0418"><span class="section-number-4">7.2.1.</span> File class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></h4>
<div class="outline-text-4" id="text-7-2-1">
<p>
The file class is an immutable data container that holds the information needed for the game to function
</p>

<div class="org-src-container">
<pre class="src src-python" id="org65a0019"><span style="color: #63b8ff;">@dataclass</span>(frozen=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">ConfigFile</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _image : pygame.Surface
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _conf : <span style="color: #b0c4de;">dict</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">image</span>(<span style="color: #00ffff;">self</span>) -&gt; pygame.Surface:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._image
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">config</span>(<span style="color: #00ffff;">self</span>) -&gt; <span style="color: #b0c4de;">dict</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._conf
</pre>
</div>
</div>
</div>
