sourcecode.org
*** Tilesheet class                                           :datacontainer:



#+Name: TileSheet
#+begin_src python :noweb yes :tangle "sourcecode.py"
@dataclass(frozen=True)
class TileSheet:
    _tiles = [pygame.Surface]
    def __init__(self,
                 file : pygame.Surface,
                 width : int,
                 height : int,
                 rows : int,
                 columns : int):
        for x in range(rows):
            for y in range(columns):
                self._tiles.append(
                    pygame.transform.scale(
                        file.subsurface(y * width, x * height, width, height),
                        (CELLSIZE, CELLSIZE)
                    )
                )
#+end_src


* Time

#+begin_center
time where did you go?.... aaaand that's all I had time for
#+end_center

In the game there's going to be two kinds of time. Firstly a realtime module that just makes sure we don't call the draw function more than 60 times a second (at most) because let's be honest... it's a text based engine so it's kindda dumb to blow up the GPU for *that*

But the second kind of time is the ingame time. That's based on turns. Every turn everything that can (and should) move, moves.

** Turn                                                       :datacontainer:

The turn class is a data container class (get used to be seeing those around btw. ) that takes care of storing whatever information a turn need.
#+Name: Turn
#+begin_src python :noweb yes :tangle "sourcecode.py"
@dataclass(frozen=Turn)
class Turn:
    turn : int
#+end_src

#+Name: TurnFactory
#+begin_src python :noweb yes :tangle "sourcecode.py"

#+end_src


* Window handler

The window class is where the initializing is going to happen, as well as where the pygame window.


#+Name: Window
#+begin_src python :noweb yes :tangle "sourcecode.py"
class Window():
    _size = (int, int)
    _surface = pygame.Surface
    def __init__(self, width, height) -> None:
        self._surface = pygame.display.set_mode((width, height), 0, 32)

        
    def surface(self) -> pygame.Surface:
        return self._surface
#+end_src


