sourcecode.html



<div id="outline-container-org3082ed3" class="outline-4">
<h4 id="org3082ed3"><span class="section-number-4">7.2.2.</span> Tilesheet class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></h4>
<div class="outline-text-4" id="text-7-2-2">
<div class="org-src-container">
<pre class="src src-python" id="org6704ad4"><span style="color: #63b8ff;">@dataclass</span>(frozen=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">TileSheet</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_tiles</span> = [pygame.Surface]
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__init__</span>(<span style="color: #00ffff;">self</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span><span style="color: #b0c4de;">file</span> : pygame.Surface,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>width : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>height : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>rows : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>columns : <span style="color: #b0c4de;">int</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> x <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(rows):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> y <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(columns):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._tiles.append(
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pygame.transform.scale(
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #b0c4de;">file</span>.subsurface(y * width, x * height, width, height),
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   (CELLSIZE, CELLSIZE)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   )
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   )
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org1ca6959" class="outline-2">
<h2 id="org1ca6959"><span class="section-number-2">8.</span> Time</h2>
<div class="outline-text-2" id="text-8">
<div class="org-center">
<p>
time where did you go?&#x2026;. aaaand that's all I had time for
</p>
</div>

<p>
In the game there's going to be two kinds of time. Firstly a realtime module that just makes sure we don't call the draw function more than 60 times a second (at most) because let's be honest&#x2026; it's a text based engine so it's kindda dumb to blow up the GPU for <b>that</b>
</p>

<p>
But the second kind of time is the ingame time. That's based on turns. Every turn everything that can (and should) move, moves.
</p>
</div>

<div id="outline-container-orga36d030" class="outline-3">
<h3 id="orga36d030"><span class="section-number-3">8.1.</span> Turn&#xa0;&#xa0;&#xa0;<span class="tag"><span class="datacontainer">datacontainer</span></span></h3>
<div class="outline-text-3" id="text-8-1">
<p>
The turn class is a data container class (get used to be seeing those around btw. ) that takes care of storing whatever information a turn need.
</p>
<div class="org-src-container">
<pre class="src src-python" id="orga5ccba9"><span style="color: #63b8ff;">@dataclass</span>(frozen=Turn)
<span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">Turn</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   turn : <span style="color: #b0c4de;">int</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="org175daf3">
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org0ff5b6f" class="outline-2">
<h2 id="org0ff5b6f"><span class="section-number-2">9.</span> Window handler</h2>
<div class="outline-text-2" id="text-9">
<p>
The window class is where the initializing is going to happen, as well as where the pygame window.
</p>


<div class="org-src-container">
<pre class="src src-python" id="orgf2ae692"><span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">Window</span>():
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_size</span> = (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_surface</span> = pygame.Surface
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__init__</span>(<span style="color: #00ffff;">self</span>, width, height) -&gt; <span style="color: #8470ff; font-weight: bold;">None</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._surface = pygame.display.set_mode((width, height), 0, 32)

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">surface</span>(<span style="color: #00ffff;">self</span>) -&gt; pygame.Surface:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._surface
</pre>
</div>
</div>
</div>
