sourcecode.tex



\subsubsection{Tilesheet class\hfill{}\textsc{datacontainer}}
\label{sec:org8f74aac}



\begin{verbatim}
@dataclass(frozen=True)
class TileSheet:
    _tiles = [pygame.Surface]
    def __init__(self,
                 file : pygame.Surface,
                 width : int,
                 height : int,
                 rows : int,
                 columns : int):
        for x in range(rows):
            for y in range(columns):
                self._tiles.append(
                    pygame.transform.scale(
                        file.subsurface(y * width, x * height, width, height),
                        (CELLSIZE, CELLSIZE)
                    )
                )
\end{verbatim}


\section{Time}
\label{sec:org801fb4e}

\begin{center}
time where did you go?\ldots{}. aaaand that's all I had time for
\end{center}

In the game there's going to be two kinds of time. Firstly a realtime module that just makes sure we don't call the draw function more than 60 times a second (at most) because let's be honest\ldots{} it's a text based engine so it's kindda dumb to blow up the GPU for \textbf{that}

But the second kind of time is the ingame time. That's based on turns. Every turn everything that can (and should) move, moves.

\subsection{Turn\hfill{}\textsc{datacontainer}}
\label{sec:orgfc4f286}

The turn class is a data container class (get used to be seeing those around btw. ) that takes care of storing whatever information a turn need.
\begin{verbatim}
@dataclass(frozen=Turn)
class Turn:
    turn : int
\end{verbatim}


\section{Window handler}
\label{sec:org48075b0}

The window class is where the initializing is going to happen, as well as where the pygame window.


\begin{verbatim}
class Window():
    _size = (int, int)
    _surface = pygame.Surface
    def __init__(self, width, height) -> None:
        self._surface = pygame.display.set_mode((width, height), 0, 32)

        
    def surface(self) -> pygame.Surface:
        return self._surface
\end{verbatim}
