sourcecode.html


<div id="outline-container-org78a5920" class="outline-2">
<h2 id="org78a5920"><span class="section-number-2">10.</span> View MIGHT BE REMOVED</h2>
<div class="outline-text-2" id="text-10">
<p>
The view holds a surface and a pygame.Rect. The rect is moved around to "slice" a subsurface from the map. 
</p>



<div class="org-src-container">
<pre class="src src-python" id="org3f095e2"><span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">View</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _camera : pygame.Rect
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_trackingObject</span> = <span style="color: #8470ff; font-weight: bold;">None</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__init__</span>(<span style="color: #00ffff;">self</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>topx : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>topy : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>cameraWidth : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>cameraHeight : <span style="color: #b0c4de;">int</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>trackingObject = <span style="color: #8470ff; font-weight: bold;">None</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._camera = pygame.Rect(topx, topy, topx+cameraWidth, topycameraHeight)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">if</span> trackingObject <span style="color: #00ffff;">is</span> <span style="color: #00ffff;">not</span> <span style="color: #8470ff; font-weight: bold;">None</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._trackingObject = trackingObject

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">slice</span>(<span style="color: #00ffff;">self</span>, surface : pygame.Surface):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> surface.Subsurface(<span style="color: #00ffff;">self</span>._camera)

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">trackObject</span>(<span style="color: #00ffff;">self</span>, surface : pygame.Surface):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">pass</span>

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">checkCenterObject</span>(<span style="color: #00ffff;">self</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">pass</span>

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">update</span>(<span style="color: #00ffff;">self</span>) -&gt; pygame.Surface:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">pass</span>
</pre>
</div>

<p>
The view function takes the relevant actor and centers the map on it.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org9eea495"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">View</span>(actor : Actor,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>surface : pygame.Surface,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>view : pygame.Rect) -&gt; pygame.Surface:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_view</span> = view
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_view.center</span> = actor.currxy()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> surface.subsurface(_view)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbbef585" class="outline-2">
<h2 id="orgbbef585"><span class="section-number-2">11.</span> Drawing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Onscreen">Onscreen</span></span></h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org3810c81" class="outline-3">
<h3 id="org3810c81"><span class="section-number-3">11.1.</span> Drawmap&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Map">Map</span></span></h3>
<div class="outline-text-3" id="text-11-1">
<p>
Drawmap function is only called to draw the surface of the static map.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgced8225"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">drawMap</span>(<span style="color: #b0c4de;">map</span> : <span style="color: #b0c4de;">str</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pos : [(<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>)],
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   tiles : [pygame.Surface],
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   destination :pygame.Surface):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _drawingList : [(pygame.Surface,(<span style="color: #b0c4de;">int</span>,<span style="color: #b0c4de;">int</span>))] = []
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">x</span> = 0
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">y</span> = 0
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> ind, c <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(<span style="color: #b0c4de;">map</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _drawingList.append((tiles[<span style="color: #b0c4de;">ord</span>(c)+1], pos[ind]))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   destination.blits(_drawingList)
</pre>
</div>
</div>
</div>
