sourcecode.tex


\section{View MIGHT BE REMOVED}
\label{sec:org451206e}

The view holds a surface and a pygame.Rect. The rect is moved around to "slice" a subsurface from the map. 



\begin{verbatim}
class View:
    _camera : pygame.Rect
    _trackingObject = None
    def __init__(self,
                 topx : int,
                 topy : int,
                 cameraWidth : int,
                 cameraHeight : int,
                 trackingObject = None):
        self._camera = pygame.Rect(topx, topy, topx+cameraWidth, topycameraHeight)
        if trackingObject is not None:
            self._trackingObject = trackingObject

    def slice(self, surface : pygame.Surface):
        return surface.Subsurface(self._camera)

    def trackObject(self, surface : pygame.Surface):
        pass

    def checkCenterObject(self):
        pass

    def update(self) -> pygame.Surface:
        pass
\end{verbatim}

The view function takes the relevant actor and centers the map on it.

\begin{verbatim}
def View(actor : Actor,
         surface : pygame.Surface,
         view : pygame.Rect) -> pygame.Surface:
    _view = view
    _view.center = actor.currxy()
    return surface.subsurface(_view)
\end{verbatim}


\section{Drawing\hfill{}\textsc{Onscreen}}
\label{sec:org77386a0}

\subsection{Drawmap\hfill{}\textsc{Map}}
\label{sec:org8b48d21}
Drawmap function is only called to draw the surface of the static map.

\begin{verbatim}
def drawMap(map : str,
            pos : [(int, int)],
            tiles : [pygame.Surface],
            destination :pygame.Surface):
    _drawingList : [(pygame.Surface,(int,int))] = []
    x = 0
    y = 0
    for ind, c in enumerate(map):
        _drawingList.append((tiles[ord(c)+1], pos[ind]))
    destination.blits(_drawingList)
\end{verbatim}
