sourcecode.org
** Drawing                                                       :Characters:
The drawing function takes one or more characters and draws them to the screen.

#+Name: Drawing
#+begin_src python :noweb yes :tangle "sourcecode.py"
def drawing(chars : str,
            pos : [(int, int)],
            tiles : [pygame.Surface],
            destination :pygame.Surface):
    _drawingList : [(pygame.Surface,(int,int))] = []
    x = 0
    y = 0

    for ind, c in enumerate(chars):
        _drawingList.append((tiles[ord(c)+1], pos[ind]))
    destination.blits(_drawingList)


#+end_src


