sourcecode.html

<div id="outline-container-org74b4b28" class="outline-3">
<h3 id="org74b4b28"><span class="section-number-3">11.2.</span> Drawing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Characters">Characters</span></span></h3>
<div class="outline-text-3" id="text-11-2">
<p>
The drawing function takes one or more characters and draws them to the screen.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgdd5f111"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">drawing</span>(chars : <span style="color: #b0c4de;">str</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pos : [(<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>)],
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   tiles : [pygame.Surface],
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   destination :pygame.Surface):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _drawingList : [(pygame.Surface,(<span style="color: #b0c4de;">int</span>,<span style="color: #b0c4de;">int</span>))] = []
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">x</span> = 0
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">y</span> = 0

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> ind, c <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(chars):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _drawingList.append((tiles[<span style="color: #b0c4de;">ord</span>(c)+1], pos[ind]))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   destination.blits(_drawingList)


</pre>
</div>
</div>
</div>
</div>
