sourcecode.html


<div id="outline-container-org08ac217" class="outline-2">
<h2 id="org08ac217"><span class="section-number-2">12.</span> Map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Map">Map</span></span></h2>
<div class="outline-text-2" id="text-12">
<p>
the map is for now just a container class for a premade "dungeon", this is to test whether or not the drawing function can handle the sheer drawing calls. AND that it can handle the various characters.
</p>

<p>
It's supposed to just have a giant, static (more or less static) image of the map.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org711eb11"><span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">Map</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _str : <span style="color: #b0c4de;">str</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _pos : [(<span style="color: #b0c4de;">int</span>,<span style="color: #b0c4de;">int</span>)] = []
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _map : pygame.Surface
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__init__</span>(<span style="color: #00ffff;">self</span>, tiles):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">TEMP map</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._str = <span style="color: #ffc1c1;">""</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">tempMap</span> = [ <span style="color: #ffc1c1;">"################################"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#       #             #        #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#       #             #        #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#       #             #        #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#       #             #        #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#           y                  #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#      Hello                   #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#       p                      #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"#                              #"</span>,
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #ffc1c1;">"################################"</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   ]
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">w</span> = <span style="color: #b0c4de;">len</span>(tempMap[0]) * CELLSIZE
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">h</span> = <span style="color: #b0c4de;">len</span>(tempMap) * CELLSIZE
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._map = pygame.Surface((w, h))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> i, s <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(tempMap):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._str = <span style="color: #00ffff;">self</span>._str + s
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> string_i, _ <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(s):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">self</span>._pos.append((string_i*CELLSIZE, i*CELLSIZE))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   drawMap(<span style="color: #00ffff;">self</span>._str, <span style="color: #00ffff;">self</span>._pos, tiles, <span style="color: #00ffff;">self</span>._map)

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">map</span>(<span style="color: #00ffff;">self</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._map
</pre>
</div>
</div>
</div>
