sourcecode.org
* Actor list                                                          :Actor:

The actor list is where a list of actors are being created.

#+Name: ActorList
#+begin_src python :noweb yes :tangle "sourcecode.py"
def makeActors(amount : int, playerIndex : int) -> [Player]:
    pass
#+end_src


* Game Loop function

The Game loop is where the structure of the game is at.

#+Name: GameLoopfunction 
#+begin_src python :noweb yes :tangle "sourcecode.py"
def GameLoop(window, _map, tiles):
    running = True
    player = Actor('@',(32,32), (32,32))
    currVec = player.currxy()
    nxtVec = player.nxtxy()
    log = []
    cl = pygame.time.Clock()
    while(running):
        movVec = (0,0)
        for event in pygame.event.get():
            match event.type:
                case pygame.QUIT:
                    running = False
                case pygame.KEYDOWN:
                    movVec = getInput(event)
        if player.arrived():
            nxtVec = tuple(map(lambda n, _n: n + ( _n * CELLSIZE), nxtVec, movVec))           
        currVec = move(player.currxy(), nxtVec)
        player = Actor( '@',currVec, nxtVec)
        window.surface().blit(_map.map(), (0,0))
        drawing(str(player), [player.currxy()], tiles._tiles, window.surface())
        pygame.display.flip()
        log.append("current vector : " + str(currVec) + "nxtVector : " + str(nxtVec) + "has player arrived: " + str(player.arrived()))
        cl.tick_busy_loop(60)
    pprint.pprint(_map.map())
#+end_src


* TODO Text                                                            :Text:

** TODO Textprinting                                               :Onscreen:

** TODO Textformatting                                           :Formatting:

** TODO Textinput                                                        :IO:



* Actor                                                               :Actor:

The player class is, for now just a place holder, keeping the player char (literally a char value), position and that's it. It does also use a couple of standard operators that I've overloaded to return just a string.


