sourcecode.html


<div id="outline-container-org8cf3768" class="outline-2">
<h2 id="org8cf3768"><span class="section-number-2">13.</span> Actor list&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></h2>
<div class="outline-text-2" id="text-13">
<p>
The actor list is where a list of actors are being created.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgcba210d"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">makeActors</span>(amount : <span style="color: #b0c4de;">int</span>, playerIndex : <span style="color: #b0c4de;">int</span>) -&gt; [Player]:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">pass</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgaa8e914" class="outline-2">
<h2 id="orgaa8e914"><span class="section-number-2">14.</span> Game Loop function</h2>
<div class="outline-text-2" id="text-14">
<p>
The Game loop is where the structure of the game is at.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgcf3fe47"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">GameLoop</span>(window, _map, tiles):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">running</span> = <span style="color: #8470ff; font-weight: bold;">True</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">player</span> = Actor(<span style="color: #ffc1c1;">'@'</span>,(32,32), (32,32))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">currVec</span> = player.currxy()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">nxtVec</span> = player.nxtxy()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">log</span> = []
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">cl</span> = pygame.time.Clock()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">while</span>(running):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">movVec</span> = (0,0)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">for</span> event <span style="color: #00ffff;">in</span> pygame.event.get():
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   match event.<span style="color: #b0c4de;">type</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   case pygame.QUIT:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">running</span> = <span style="color: #8470ff; font-weight: bold;">False</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   case pygame.KEYDOWN:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">movVec</span> = getInput(event)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">if</span> player.arrived():
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">nxtVec</span> = <span style="color: #b0c4de;">tuple</span>(<span style="color: #b0c4de;">map</span>(<span style="color: #00ffff;">lambda</span> n, _n: n + ( _n * CELLSIZE), nxtVec, movVec))           
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">currVec</span> = move(player.currxy(), nxtVec)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">player</span> = Actor( <span style="color: #ffc1c1;">'@'</span>,currVec, nxtVec)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   window.surface().blit(_map.<span style="color: #b0c4de;">map</span>(), (0,0))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   drawing(<span style="color: #b0c4de;">str</span>(player), [player.currxy()], tiles._tiles, window.surface())
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pygame.display.flip()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   log.append(<span style="color: #ffc1c1;">"current vector : "</span> + <span style="color: #b0c4de;">str</span>(currVec) + <span style="color: #ffc1c1;">"nxtVector : "</span> + <span style="color: #b0c4de;">str</span>(nxtVec) + <span style="color: #ffc1c1;">"has player arrived: "</span> + <span style="color: #b0c4de;">str</span>(player.arrived()))
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   cl.tick_busy_loop(60)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pprint.pprint(_map.<span style="color: #b0c4de;">map</span>())
</pre>
</div>
</div>
</div>


<div id="outline-container-org31a3f13" class="outline-2">
<h2 id="org31a3f13"><span class="section-number-2">15.</span> <span class="todo TODO">TODO</span> Text&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Text">Text</span></span></h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-orga289329" class="outline-3">
<h3 id="orga289329"><span class="section-number-3">15.1.</span> <span class="todo TODO">TODO</span> Textprinting&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Onscreen">Onscreen</span></span></h3>
</div>

<div id="outline-container-org7810ed5" class="outline-3">
<h3 id="org7810ed5"><span class="section-number-3">15.2.</span> <span class="todo TODO">TODO</span> Textformatting</h3>
</div>

<div id="outline-container-orgee4354d" class="outline-3">
<h3 id="orgee4354d"><span class="section-number-3">15.3.</span> <span class="todo TODO">TODO</span> Textinput</h3>
</div>
</div>



<div id="outline-container-org9c35727" class="outline-2">
<h2 id="org9c35727"><span class="section-number-2">16.</span> Actor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Actor">Actor</span></span></h2>
<div class="outline-text-2" id="text-16">
<p>
The player class is, for now just a place holder, keeping the player char (literally a char value), position and that's it. It does also use a couple of standard operators that I've overloaded to return just a string.
</p>
</div>
