sourcecode.tex


\section{Actor list\hfill{}\textsc{Actor}}
\label{sec:org5ef3cf5}

The actor list is where a list of actors are being created.

\begin{verbatim}
def makeActors(amount : int, playerIndex : int) -> [Player]:
    pass
\end{verbatim}


\section{Game Loop function}
\label{sec:org53aee92}

The Game loop is where the structure of the game is at.

\begin{verbatim}
def GameLoop(window, _map, tiles):
    running = True
    player = Actor('@',(32,32), (32,32))
    currVec = player.currxy()
    nxtVec = player.nxtxy()
    log = []
    cl = pygame.time.Clock()
    while(running):
        movVec = (0,0)
        for event in pygame.event.get():
            match event.type:
                case pygame.QUIT:
                    running = False
                case pygame.KEYDOWN:
                    movVec = getInput(event)
        if player.arrived():
            nxtVec = tuple(map(lambda n, _n: n + ( _n * CELLSIZE), nxtVec, movVec))           
        currVec = move(player.currxy(), nxtVec)
        player = Actor( '@',currVec, nxtVec)
        window.surface().blit(_map.map(), (0,0))
        drawing(str(player), [player.currxy()], tiles._tiles, window.surface())
        pygame.display.flip()
        log.append("current vector : " + str(currVec) + "nxtVector : " + str(nxtVec) + "has player arrived: " + str(player.arrived()))
        cl.tick_busy_loop(60)
    pprint.pprint(_map.map())
\end{verbatim}


\section{{\bfseries\sffamily TODO} Text\hfill{}\textsc{Text}}
\label{sec:orge1c0444}

\subsection{{\bfseries\sffamily TODO} Textprinting\hfill{}\textsc{Onscreen}}
\label{sec:org428af1a}

\subsection{{\bfseries\sffamily TODO} Textformatting}
\label{sec:orgb04070c}

\subsection{{\bfseries\sffamily TODO} Textinput}
\label{sec:org26f1ada}



\section{Actor\hfill{}\textsc{Actor}}
\label{sec:org007a2f5}

The player class is, for now just a place holder, keeping the player char (literally a char value), position and that's it. It does also use a couple of standard operators that I've overloaded to return just a string.
