sourcecode.org
** Actor class                                                :Datacontainer:
#+Name: Actorclass
#+begin_src python :noweb yes :tangle "sourcecode.py"
@dataclass(frozen=True)
class Actor:
    _c : chr = field(init=True)
    xy : (int, int) = field(init=True)
    _xy : (int, int) = field(init=True)
    def arrived(self) -> bool:
        return self.xy == self._xy

    def currxy(self):
        return self.xy

    def nxtxy(self):
        return self._xy

    def __repr__(self):
        return self._c
#+end_src


** Update Actors

The update actor function is going to map onto the list of actors in the game.

#+Name: updateActor
#+begin_src python :noweb yes :tangle "sourcecode.py"
def updateActor(lstOfActors : [Actor]) -> [Actor]:
    # retLst = []
    # #check collision
    # lstCollision
    # for nxt in lstOfActors:
    #     lstCollision.append(nxt.
    # for actor in lstOfActors:
    #     currVec = move(actor.currxy(), actor.nxtxy())
    pass
#+end_src


* TODO Sound                                                             :IO:

Sounds 

** Music                                                              :Music:

Currently I'm not sure whether or not to include music in this project... 
It would be kindda cool to include lilypad

#+begin_src lilypond

#+end_src

* Main                                                                 :Main:

In the main function I initialize the different components, like the window, the gameloop function, etc.

#+Name: Mainfunction
#+begin_src python :tangle "sourcecode.py" 
def main():
    pygame.init()
    pygame.font.init()
    # -------
    _files = loadFiles()
    _tiles = TileSheet(_files.image(), 8, 8, 16, 16)
    window = Window(800, 600)
    map = Map(_tiles._tiles)
    GameLoop(window, map, _tiles)
    # -------
    pygame.quit()
#+end_src



#+Name: Main
#+begin_src python :tangle "sourcecode.py"
if __name__=="__main__":
    main()
#+end_src
