sourcecode.html


<div id="outline-container-org292f3ce" class="outline-3">
<h3 id="org292f3ce"><span class="section-number-3">16.1.</span> Actor class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Datacontainer">Datacontainer</span></span></h3>
<div class="outline-text-3" id="text-16-1">
<div class="org-src-container">
<pre class="src src-python" id="orgcf65b30"><span style="color: #63b8ff;">@dataclass</span>(frozen=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #00ffff;">class</span> <span style="color: #63b8ff;">Actor</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _c : <span style="color: #b0c4de;">chr</span> = field(init=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   xy : (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>) = field(init=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   _xy : (<span style="color: #b0c4de;">int</span>, <span style="color: #b0c4de;">int</span>) = field(init=<span style="color: #8470ff; font-weight: bold;">True</span>)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">arrived</span>(<span style="color: #00ffff;">self</span>) -&gt; <span style="color: #b0c4de;">bool</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>.xy == <span style="color: #00ffff;">self</span>._xy

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">currxy</span>(<span style="color: #00ffff;">self</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>.xy

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">nxtxy</span>(<span style="color: #00ffff;">self</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._xy

<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">__repr__</span>(<span style="color: #00ffff;">self</span>):
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">return</span> <span style="color: #00ffff;">self</span>._c
</pre>
</div>
</div>
</div>


<div id="outline-container-orgfe62f71" class="outline-3">
<h3 id="orgfe62f71"><span class="section-number-3">16.2.</span> Update Actors</h3>
<div class="outline-text-3" id="text-16-2">
<p>
The update actor function is going to map onto the list of actors in the game.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org74e38ec"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">updateActor</span>(lstOfActors : [Actor]) -&gt; [Actor]:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">retLst = []</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">#check collision</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">lstCollision</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">for nxt in lstOfActors:</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;">#     </span><span style="color: #ff7f24; font-style: italic;">lstCollision.append(nxt.</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">for actor in lstOfActors:</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;">#     </span><span style="color: #ff7f24; font-style: italic;">currVec = move(actor.currxy(), actor.nxtxy())</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #00ffff;">pass</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org2a4c3f7" class="outline-2">
<h2 id="org2a4c3f7"><span class="section-number-2">17.</span> Main</h2>
<div class="outline-text-2" id="text-17">
<p>
In the main function I initialize the different components, like the window, the gameloop function, etc.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgd4c843d"><span style="color: #00ffff;">def</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">main</span>():
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pygame.init()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pygame.font.init()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">-------</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_files</span> = loadFiles()
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">_tiles</span> = TileSheet(_files.image(), 8, 8, 16, 16)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #7fffd4;">window</span> = Window(800, 600)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #b0c4de;">map</span> = Map(_tiles._tiles)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   GameLoop(window, <span style="color: #b0c4de;">map</span>, _tiles)
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   <span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">-------</span>
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   pygame.<span style="color: #8470ff; font-weight: bold;">quit</span>()
</pre>
</div>



<div class="org-src-container">
<pre class="src src-python" id="org8b84021"><span style="color: #00ffff;">if</span> <span style="color: #b0c4de;">__name__</span>==<span style="color: #ffc1c1;">"__main__"</span>:
<span style="color: #f5deb3; background-color: #4d4d4d;"> </span>   main()
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-07-28 Thu 13:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
