sourcecode.tex


\subsection{Actor class\hfill{}\textsc{Datacontainer}}
\label{sec:org54f1a8e}
\begin{verbatim}
@dataclass(frozen=True)
class Actor:
    _c : chr = field(init=True)
    xy : (int, int) = field(init=True)
    _xy : (int, int) = field(init=True)
    def arrived(self) -> bool:
        return self.xy == self._xy

    def currxy(self):
        return self.xy

    def nxtxy(self):
        return self._xy

    def __repr__(self):
        return self._c
\end{verbatim}


\subsection{Update Actors}
\label{sec:org5fb9c53}

The update actor function is going to map onto the list of actors in the game.

\begin{verbatim}
def updateActor(lstOfActors : [Actor]) -> [Actor]:
    # retLst = []
    # #check collision
    # lstCollision
    # for nxt in lstOfActors:
    #     lstCollision.append(nxt.
    # for actor in lstOfActors:
    #     currVec = move(actor.currxy(), actor.nxtxy())
    pass
\end{verbatim}



\section{Main}
\label{sec:orgb23b180}

In the main function I initialize the different components, like the window, the gameloop function, etc.

\begin{verbatim}
def main():
    pygame.init()
    pygame.font.init()
    # -------
    _files = loadFiles()
    _tiles = TileSheet(_files.image(), 8, 8, 16, 16)
    window = Window(800, 600)
    map = Map(_tiles._tiles)
    GameLoop(window, map, _tiles)
    # -------
    pygame.quit()
\end{verbatim}



\begin{verbatim}
if __name__=="__main__":
    main()
\end{verbatim}
\end{document}